package interfaces

import (
	"fmt"
	"strconv"
	"strings"
	"unicode"
)

// StepTen
/*
Обязательные условия выполнения: данные со стандартного ввода читаются функцией readTask(),
которая возвращает 3 значения типа пустой интерфейс.
Эта функция использует пакеты encoding/json, fmt, и os - не удаляйте их из импорта.
Скорее всего, вам понадобится пакет "fmt", но вы можете использовать любой другой пакет
для записи в стандартный вывод не удаляя fmt.

Итак, вы получаете 3 значения типа пустой интерфейс:
если все удачно, то первые 2 значения будут float64.
Третье значение в идеальном случае будет строкой, которая может иметь значения: "+", "-", "*", "/"
(определенная математическая операция).
Но такие идеальные случаи будут не всегда, вы можете получить значения других типов,
а также строка в третьем значении может не относится к одной из указанных математических операций.

Результат выполнения программы должен быть таков:

в штатной ситуации вы должны напечатать в стандартный вывод результат выполнения математической операции
с точностью до 4 цифры после запятой (fmt.Printf(%.4f));
если первое или второе значение не является типом float64,
вы должны напечатать сообщение об ошибке вида:
value=полученное_значение: тип_значения (например: value=true: bool)
если третье значение имеет неверный тип или передан знак, не относящийся к указанным выше математическим операциям,
сообщение об ошибке должно иметь вид: неизвестная операция

Гарантируется, что ошибка в аргументах может быть только одна, поэтому если вы при проверке первого значения увидели,
что оно содержит ошибку - печатайте сообщение об ошибке и завершайте работу программы,
проверка остальных аргументов значения уже не имеет,
а проверяющая система воспримет 2 сообщения об ошибке как нарушение условия выполнения задания.
*/
func StepTen() {
	value1, value2, operation := readTask() // исходные данные получаются с помощью этой функции
	// все полученные значения имеют тип пустого интерфейса

	var first, second, result float64

	if val, ok := value1.(float64); ok {
		first = val
	} else {
		fmt.Printf("value=%v: %T", value1, value1)
		return
	}

	if val, ok := value2.(float64); ok {
		second = val
	} else {
		fmt.Printf("value=%v: %T", value2, value2)
		return
	}

	if op, ok := operation.(string); ok {
		switch op {
		case "+":
			result = first + second

		case "-":
			result = first - second

		case "*":
			result = first * second

		case "/":
			if second == 0 {
				panic("divide by zero")
			} else {
				result = first / second
			}

		default:
			fmt.Println("неизвестная операция")
			return
		}

		fmt.Printf("%.4f", result)
	} else {
		fmt.Println("неизвестная операция")
	}
}

func readTask() (interface{}, interface{}, interface{}) {
	return 123.45, 256.98, "+"
}

// StepThirteen
/*
Давайте используем ваши знания структур, методов и интерфейсов на практике и реализуем объект,
удовлетворяющий интерфейсу fmt.Stringer. Назовем его "Батарейка".

Во-первых, вы должны объявить новый тип, удовлетворяющий интерфейсу fmt.Stringer.

Ваш тип должен предусматривать, что на печати он будет выглядеть так: [      XXXX]:
где пробелы - "опустошенная" емкость батареи, а X - "заряженная".

Во-вторых, на стандартный ввод вы получаете строку, состоящую ровно из 10 цифр: 0 или 1 (порядок 0/1 случайный).
Ваша задача считать эту строку любым возможным способом и создать на основе этой строки
объект объявленного вами на первом этапе типа: надеюсь, вы понимаете,
что строка символизирует емкость батарейки: 0 - это "опустошенная" часть, а 1 - "заряженная".

В-третьих, созданный вами объект должен называться batteryForTest (использование этого имени обязательно).

В вашем распоряжении фактически весь файл,
НО завершающая фигурная скобка функции main() вам не видна, но она присутствует.

Перед этой скобкой присутствует функция (которая вам тоже не видна),
принимающая в качестве аргумента объект типа fmt.Stringer - batteryForTest,
и направляющая его на стандартный вывод, поэтому вам не требуется выводить что-то на печать самостоятельно.
*/
func StepThirteen() {
	var inputStr string
	fmt.Scan(&inputStr)
	//inputStr = "1000010011"

	var runeStr = []rune(inputStr)
	batteryForTest := Battery{}

	for _, val := range runeStr {
		number, err := strconv.Atoi(string(val))

		if unicode.IsDigit(val) && err == nil && number != 0 {
			batteryForTest.capacity++
		}
	}

	fmt.Println(batteryForTest)
}

type Battery struct {
	capacity int
}

func (b Battery) String() string {
	capacity := strings.Repeat("X", b.capacity)

	return fmt.Sprintf("[%10s]", capacity)
}
